Tekla.Structures.ModelInternal.Operation.OverlayModel
Overlay model struct

Tekla.Structures.ModelInternal.Operation.OverlayModel.Path
The path of the overlay model.

Tekla.Structures.ModelInternal.Operation.OverlayModel.BasePointGuid
The base point guid.

Tekla.Structures.ModelInternal.Operation.OverlayModel.Origin
The origin.

Tekla.Structures.ModelInternal.Operation.OverlayModel.AxisX
The X axis

Tekla.Structures.ModelInternal.Operation.OverlayModel.AxisY
The Y axis

Tekla.Structures.ModelInternal.Operation.OverlayModel.Scale
The scale

Tekla.Structures.ModelInternal.Operation.OverlayModel.TcModelId
The TC model id

Tekla.Structures.ModelInternal.Operation.OverlayModel.TcModelVersionId
The TC model version id

Tekla.Structures.ModelInternal.Operation.OverlayModel.IsVisible
Visibility of the overlay model

Tekla.Structures.ModelInternal.Operation.OverlayModel.TcModelName
The TC model name